package Lesson4;

import java.util.Scanner;

public class LoopDoWhile {
    public static void main(String[] args) {

        /// всегда выполняется минимум один раз,
        /// а условие проверяется после выполнения тела.

//        Scanner scanner = new Scanner(System.in);   // создаём Scanner для чтения ввода с консоли
//        String answer;                              // переменная для хранения ответа пользователя
//
//        do {                                       // начинаем цикл, который выполнится минимум один раз
//            System.out.println("Вы уверены? (yes/no)"); // выводим вопрос пользователю
//            answer = scanner.nextLine();            // считываем строку, введённую пользователем
//        } while (!answer.equals("yes"));            // Условие, пока в скобках тру - выполняем, когда фолс - заканчиваем.



        //Задача
        //Написать программу, которая:
        //минимум один раз запрашивает у пользователя строку
        //выводит введённую строку
        //повторяет ввод, пока пользователь не введёт "exit"
        //после ввода "exit" выводит сообщение:
        //«Программа завершена»

//        Scanner scanner = new Scanner(System.in);
//        String userInput;
//        String exit = "exit";
//
//        do {
//            System.out.println("Введите строку");
//            userInput = scanner.nextLine();
//            System.out.println("Вы ввели : " +  userInput);
//
//        } while (!userInput.equals(exit));
//        System.out.println("вы вышли ");
//








    }
}
