package Lesson4;

public class LoopFor {
    public static void main(String[] args) {

        ///  FOR loop используется когда известно количество повторений.

//            //переменная-счетчик   Условие выполняется пока тру   Действие после каждой итерации
//        for (      int i = 1;             i <=5;                     i++) {
//
//            System.out.println("Итерация :" + i);
//            // если бы i ==5, цикл бы не начался, так как і не равно 5
//        }

              //Порядок выполнение действий
        //1 - int i = 1;
        //2 - i <= 5;
        //3 - System.out.println("Итерация :" + i);
        //4 - i++

        // //////////////////////////////////////////////////////////////////
        int sum = 0;
        for (int i = 1; i <= 5; i++) {
        sum = sum + i;   //sum += i;
        }
        System.out.println("Сумма: " + sum); // 15

        // ///////////////////////////////////////////////////////////////////////
//        int n = 10;
//        int sum = 0;
//
//        for (int i = 1; i <= n; i++) {
//            sum += i;
//        }
//        System.out.println("Сумма: " + sum);





















    }
}
