package Lesson6;

public class TaskArray {

    public static void main(String[] args) {


        /// Задача 1 — базовая
        /// Есть массив строк.
        /// Нужно:
        /// вывести все элементы массива
        /// вывести первый элемент
        /// вывести последний элемент
        String[] heroes = {
                "Saske",
                "Itachi",
                "Sakura",
                "Gaara",
                "Kakashi"
        };

        for (int i = 0; i < heroes.length; i++) {
            System.out.println(heroes[i]);
        }
        System.out.println("////////////////////////////////////");
        System.out.println(heroes[0]);
        System.out.println(heroes[heroes.length - 1]);

        /// Задача 2 — индексы
        /// Есть массив чисел.
        /// Нужно:
        /// вывести все числа с индексами
        ///  index 0 -> value ...
        /// index 1 -> value ...


        int[] numbers = {10, 434, 22, 23, 7};
        for (int i = 0; i < numbers.length; i++) {
            System.out.println("index " + i + " -> " + numbers[i]);
        }
        System.out.println("////////////////////////////////////////////");

        /// Задача 3 — сумма элементов массива
        /// Есть массив int.
        /// Нужно:
        /// пройти по всем элементам массива
        /// посчитать сумму всех чисел
        /// вывести результат

        int sum = 0;
        int[] massive = {6, 7, 23, 27};

        for (int i = 0; i < massive.length; i++) {
            sum = sum + massive[i];
        }
        System.out.println(sum);
        System.out.println("////////////////////////////////////////////");


        /// 🔹 Задача 4 — поиск элемента в массиве (ДУБЛИРУЮ)
        /// Есть массив строк.
        /// Нужно:
        /// проверить, есть ли в массиве строка "Obito"
        /// если есть → вывести

        String[] heroesNaruto = {"Hinata", "Tsunade", "RockLee", "Upito"};

        boolean found = false;

        for (int i = 0; i < heroesNaruto.length; i++) {
            if (heroesNaruto[i].equals("Obito")) {// В Java строки сравниваются через equals(). | == сравнивает ссылки (адреса в памяти)
                found = true;
            }
        }
        if (found) {
            System.out.println("Found");
        } else {
            System.out.println("Not found");
        }
        System.out.println("////////////////////////////////////////////");


        ///  Задача 5 — пропуск элемента (ДУБЛИРУЮ)
        /// Есть массив чисел.
        /// Нужно:
        /// вывести все числа массива
        /// НЕ выводить число 0

        int[] numbers1 = {1, 0, 3, 0, 5};
        for (int numb : numbers1) {
            if (numb > 0) {
                System.out.println(numb);
            }
        }
        System.out.println("////////////////////////////////////////////");


        ///  Следующая — Задача 6 (ДУБЛИРУЮ)
        /// Есть массив строк.
        /// Нужно:
        /// сохранить предпоследний элемент в переменную
        /// вывести её

        String[] titles = {"Home", "Login", "Dashboard", "Settings"};

        String beforeLast = titles[titles.length - 2];
        System.out.println(beforeLast);

    }
}

